app/Filters/RoleAuth.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '6'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $session = session();

        // Check if user is logged in
        if (!$session->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        // Check if admin forced logout by changing password
        $userId = $session->get('user_id');
        $loginTime = $session->get('login_time');

        if ($userId && $loginTime) {
            try {
                $userModel = new UserModel();
                $user = $userModel->find($userId);