app/Views/courses/index.php

              if (!empty($enrolledCourses ?? [])) {
                $materialModel = new \App\Models\MaterialModel();
                foreach ($enrolledCourses as $course) {
                  $materials = $materialModel->where('course_id', $course['course_id'])->findAll();
---
SELECT *
FROM `materials`
WHERE `course_id` = '4'

              if (!empty($enrolledCourses ?? [])) {
                $assignmentModel = new \App\Models\AssignmentModel();
                foreach ($enrolledCourses as $course) {
                  $assignments = $assignmentModel->where('course_id', $course['course_id'])->findAll();
---
SELECT *
FROM `assignments`
WHERE `course_id` = '4'