app/Controllers/Auth.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
            $materialModel = new \App\Models\MaterialModel();

            // Get total users by role
            $totalUsers = $userModel->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `courses`
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
---
            $totalStudents = $userModel->countUsersByRoleName('student');

            // Get course statistics
            $totalCourses = $courseModel->countAllResults();

            // Get enrollment statistics
            $totalEnrollments = $enrollmentModel->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `announcements`
SELECT COUNT(*) AS `numrows`
FROM `materials`
---
                ->countAllResults();

            // Get announcements count
            $totalAnnouncements = $announcementModel->countAllResults();

            // Get materials count
            $totalMaterials = $materialModel->countAllResults();

SELECT *
FROM `courses`
ORDER BY `created_at` DESC
 LIMIT 5
---
            $recentUsers = $builder->get()->getResultArray();

            // Get recent courses (last 5)
            $recentCourses = $courseModel->orderBy('created_at', 'DESC')->limit(5)->findAll();