app/Controllers/Course.php

INSERT INTO `notifications` (`user_id`, `message`, `is_read`, `created_at`) VALUES ('6', 'You have been enrolled in Cybersecurity Fundamentals', 0, '2025-10-27 14:41:02')
---
        if ($enrollmentId) {
            // Create notification
            $notificationModel = new \App\Models\NotificationModel();
            $notificationModel->insert([
                'user_id' => $user_id,
                'message' => "You have been enrolled in " . $course['course_name'],
                'is_read' => 0,
                'created_at' => date('Y-m-d H:i:s')
            ]);