app/Controllers/UserManagement.php

SELECT `users`.*, `roles`.`role_name` as `role`
FROM `users`
LEFT JOIN `roles` ON `users`.`role_id` = `roles`.`id`
---
    public function index()
    {
        $session = session();

        // Check if user is logged in and is admin
        if (!$session->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        if ($session->get('userRole') !== 'admin') {
            return redirect()->to(base_url('dashboard'))
                ->with('error', 'Access Denied: Admin only');
        }

        // Get all users (including soft deleted) with role information
        $db = \Config\Database::connect();
        $users = $db->table('users')
            ->select('users.*, roles.role_name as role')
            ->join('roles', 'users.role_id = roles.id', 'left')
            ->get()
            ->getResultArray();