app/Models/CourseModel.php

SELECT `c`.`course_id`, `c`.`course_number`, `c`.`description`, `c`.`units`, `c`.`academic_year`, `c`.`semester`, `c`.`term`, `c`.`schedule_time`, `c`.`schedule_date`, `c`.`teacher_id`, `c`.`status`, `c`.`created_at`, `u`.`name` as `teacher_name`
FROM `courses` `c`
LEFT JOIN `users` `u` ON `c`.`teacher_id` = `u`.`id`
WHERE `c`.`teacher_id` IS NOT NULL
AND `c`.`status` = 'active'
AND `c`.`course_id` NOT IN (SELECT `course_id` FROM `enrollments` WHERE `user_id` = '8')
ORDER BY `c`.`created_at` DESC
---
    public function getAvailableCoursesForStudent($studentId)
    {
        $builder = $this->db->table('courses c');
        $builder->select('c.course_id, c.course_number, c.description, c.units, c.academic_year, c.semester, c.term, c.schedule_time, c.schedule_date, c.teacher_id, c.status, c.created_at, u.name as teacher_name');
        $builder->join('users u', 'c.teacher_id = u.id', 'left');
        $builder->where('c.teacher_id IS NOT NULL');
        $builder->where('c.status', 'active'); // Only show courses that have been activated by teachers
        $builder->whereNotIn('c.course_id', function($query) use ($studentId) {
            $query->select('course_id')
                  ->from('enrollments')
                  ->where('user_id', $studentId);
        });
        $builder->orderBy('c.created_at', 'DESC');

        return $builder->get()->getResultArray();

SELECT *
FROM `courses`
WHERE `courses`.`course_id` = '6'
---
    public function getCourseWithTeacher($courseId)
    {
        $builder = $this->db->table('courses c');
        $builder->select('c.*, u.name as teacher_name, u.email as teacher_email');
        $builder->join('users u', 'c.teacher_id = u.id', 'left');
        $builder->where('c.course_id', $courseId);

        return $builder->get()->getRowArray();

SELECT *
FROM `courses`
WHERE `teacher_id` = '28'
ORDER BY `created_at` DESC
---
    public function getCoursesByTeacher($teacherId)
    {
        // First get all courses for the teacher
        $courses = $this->where('teacher_id', $teacherId)
                       ->orderBy('created_at', 'DESC')
                       ->findAll();

SELECT `c`.*, `u`.`name` as `teacher_name`
FROM `courses` `c`
LEFT JOIN `users` `u` ON `c`.`teacher_id` = `u`.`id`
WHERE `c`.`teacher_id` IS NOT NULL
ORDER BY `c`.`created_at` DESC
---
    public function getAllCoursesWithTeachers()
    {
        $builder = $this->db->table('courses c');
        $builder->select('c.*, u.name as teacher_name');
        $builder->join('users u', 'c.teacher_id = u.id', 'left');
        $builder->where('c.teacher_id IS NOT NULL');
        $builder->orderBy('c.created_at', 'DESC');

        return $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `materials` `m`
JOIN `courses` `c` ON `m`.`course_id` = `c`.`course_id`
WHERE `c`.`teacher_id` = '28'
---
    public function getTotalMaterialsByTeacher($teacherId)
    {
        $builder = $this->db->table('materials m');
        $builder->join('courses c', 'm.course_id = c.course_id');
        $builder->where('c.teacher_id', $teacherId);

        return $builder->countAllResults();