app/Models/EnrollmentStatusModel.php

SELECT *
FROM `enrollment_statuses`
WHERE `status_name` = 'enrolled'
 LIMIT 1
---
    public function getStatusIdByName($statusName)
    {
        $status = $this->where('status_name', $statusName)->first();