app/Models/EnrollmentModel.php

    public function enrollUser($data)
    {
        $statusModel = new EnrollmentStatusModel();

        // Get status ID from status name if provided, otherwise default to 'enrolled'
        $statusName = $data['status'] ?? 'enrolled';
        $statusId = $statusModel->getStatusIdByName($statusName);

        if (!$statusId) {
            // Default to enrolled if status not found
            $statusId = $statusModel->getStatusIdByName('enrolled');
        }

        // Set default values
        $enrollmentData = [
            'user_id' => $data['user_id'],
            'course_id' => $data['course_id'],
            'enrollment_date' => $data['enrollment_date'] ?? date('Y-m-d H:i:s'),
            'status_id' => $statusId,
        ];

        return $this->insert($enrollmentData);
---
INSERT INTO `enrollments` (`user_id`, `course_id`, `enrollment_date`, `created_at`, `updated_at`) VALUES ('6', '6', '2025-10-27 14:41:02', '2025-10-27 14:41:02', '2025-10-27 14:41:02')

    public function getUserEnrollments($user_id)
    {
        $builder = $this->db->table('enrollments e');
        $builder->select('e.*, c.course_id, c.course_number, c.description, c.units, c.academic_year, c.semester, c.term, c.schedule_time, c.schedule_date, u.name as teacher_name, es.status_name as status');
        $builder->join('courses c', 'e.course_id = c.course_id', 'left');
        $builder->join('users u', 'c.teacher_id = u.id', 'left');
        $builder->join('enrollment_statuses es', 'e.status_id = es.id', 'left');
        $builder->where('e.user_id', $user_id);
        $builder->orderBy('e.enrollment_date', 'DESC');

        return $builder->get()->getResultArray();
---
SELECT `e`.*, `c`.`course_id`, `c`.`course_number`, `c`.`description`, `c`.`units`, `c`.`academic_year`, `c`.`semester`, `c`.`term`, `c`.`schedule_time`, `c`.`schedule_date`, `u`.`name` as `teacher_name`, `es`.`status_name` as `status`
FROM `enrollments` `e`
LEFT JOIN `courses` `c` ON `e`.`course_id` = `c`.`course_id`
LEFT JOIN `users` `u` ON `c`.`teacher_id` = `u`.`id`
LEFT JOIN `enrollment_statuses` `es` ON `e`.`status_id` = `es`.`id`
WHERE `e`.`user_id` = '9'
ORDER BY `e`.`enrollment_date` DESC

    public function getEnrollmentByUserAndCourse($user_id, $course_id)
    {
        return $this->where('user_id', $user_id)
                   ->where('course_id', $course_id)
                   ->first();
---
SELECT *
FROM `enrollments`
WHERE `user_id` = '6'
AND `course_id` = '6'
 LIMIT 1

    public function getCourseEnrollmentCount($course_id)
    {
        $statusModel = new EnrollmentStatusModel();
        $enrolledStatusId = $statusModel->getStatusIdByName('enrolled');
        $activeStatusId = $statusModel->getStatusIdByName('active');

        // Collect valid status IDs
        $validStatusIds = [];
        if ($enrolledStatusId !== null) {
            $validStatusIds[] = $enrolledStatusId;
        }
        if ($activeStatusId !== null) {
            $validStatusIds[] = $activeStatusId;
        }

        $builder = $this->db->table('enrollments');
        $builder->where('course_id', $course_id);

        // Only apply whereIn if we have valid status IDs
        if (!empty($validStatusIds)) {
            $builder->whereIn('status_id', $validStatusIds);
        }

        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `course_id` = '7'
AND `status_id` IN ('1','2')