app/Models/ProgramModel.php

SELECT *
FROM `programs`
WHERE `teacher_id` IS NULL
AND `status` = 'active'
ORDER BY `program_name` ASC
---
    public function getProgramsByTeacher($teacherId)
    {
        return $this->where('teacher_id', $teacherId)
                    ->where('status', 'active')
                    ->orderBy('program_name', 'ASC')
                    ->findAll();