app/Models/UserModel.php

    public function findByEmailWithRole($email)
    {
        $builder = $this->builder();
        $builder->select('users.*, roles.role_name as role');
        $builder->join('roles', 'users.role_id = roles.id', 'left');
        $builder->where('users.email', $email);

        // Include soft-deleted users for login purposes
        $builder->where('users.deleted_at', null);

        $result = $builder->get()->getRowArray();
---
SELECT `users`.*, `roles`.`role_name` as `role`
FROM `users`
LEFT JOIN `roles` ON `users`.`role_id` = `roles`.`id`
WHERE `users`.`email` = 'admin@gmail.com'
AND `users`.`deleted_at` IS NULL